    <!DOCTYPE html>
    <html lang="en">
    <head>
        <meta charset="UTF-8">
        <meta http-equiv="X-UA-Compatible" content="IE=edge">
        <meta name="viewport" content="width=device-width, initial-scale=1.0">
        <title>Document</title>
    </head>
    <body>
        <?php 

        //Задание 1
        $i = 0;
        while ($i <= 100) {
            if ($i % 3 == 0) {
                echo $i;
                $i++;
            } else {
                $i++;
            }
        }
       echo "<br><br>";

        //Задание 2
        $i = 0;
        function numbers() {
            do {
                if ($i == 0) {
                    echo "0 — ноль. <br>";
                    $i++;
                } if ($i % 2 !== 0) {
                    echo $i . " — нечетное число. <br>";
                    $i++;
                } if ($i % 2 == 0) {
                    echo $i . " — четное число. <br>";
                    $i++;
                }
            } while ($i <= 10);
        }
        numbers();
        echo "<br>";
        

        //Задание 3
        $cities = [
            'Московская область:' => ['Москва, Зеленоград, Клин'],
            'Ленинградская область:' => ['Санкт-Петербург, Всеволожск, Павловск, Кронштадт'],
            'Рязанская область:' => ['Рязань, Скопин, Касимов']
        ];
        foreach ($cities as $key => $value) {
            foreach ($value as $city) {
                echo "$key <br>";
                echo "$city <br>";
            }    
        } 
        echo "<br>";

        //Задание 4
        $letters = [
            'а' => 'a', 
            'б' => 'b', 
            'в' => 'v', 
            'г' => 'g', 
            'д' => 'd', 
            'е' => 'e', 
            'ё' => 'yo', 
            'ж' => 'zh', 
            'з' => 'z',
            'и' => 'i',
            'й' => 'j',
            'к' => 'k',
            'л' => 'l',
            'м' => 'm',
            'н' => 'n',
            'о' => 'o',
            'п' => 'p',
            'р' => 'r',
            'с' => 's',
            'т' => 't',
            'у' => 'u',
            'ф' => 'f',
            'х' => 'x',
            'ц' => 'cz',
            'ч' => 'ch',
            'ш' => 'sh',
            'щ' => 'shh',
            'ъ' => '``',
            'ь' => '`',
            'э' => 'e`',
            'ю' => 'yu',
            'я' => 'ya'
         ];
        echo strtr("люди, львы, орлы и куропатки, рогатые олени, гуси, пауки, молчаливые рыбы, обитавшие в воде, морские звезды и те, которых нельзя было видеть глазом,— словом, все жизни, свершив печальный круг, угасли.", $letters);
        echo "<br><br>";

        //Задание 5
        $phrase = "Люди львы орлы и куропатки рогатые олени гуси пауки молчаливые рыбы обитавшие в воде морские звезды и те которых нельзя было видеть глазом словом все жизни свершив печальный круг угасли.";
        $phrase = strtr($phrase, " ", "_");
        echo $phrase;
        echo "<br>";

        //Задание 6
        $menu = ['Снег', 'Лед', 'Холод', 'Мороз'];
        echo "<ul><li>" . implode('</li><li>', $menu) . "</li></ul>";
        echo "<br>";
 
        ?>
    </body>
    </html>